# Solutions

1. [Groupby Aggregation Basics](#1.-Groupby-Aggregation-Basics)
1. [Grouping and Aggregating with Multiple Columns](#2.-Grouping-and-Aggregating-with-Multiple-Columns)
1. [Grouping with Pivot Tables](#3.-Grouping-with-Pivot-Tables)
1. [Counting with Crosstabs](#4.-Counting-with-Crosstabs)
1. [Alternate Groupby Syntax](#5.-Alternate-Groupby-Syntax)
1. [Custom Aggregation](#6.-Custom-Aggregation)
1. [Transform and Filter with Groupby](#7.-Transform-and-Filter-with-Groupby)
1. [Other Groupby Methods](#8.-Other-Groupby-Methods)
1. [Create your own Data Analysis](#9.-Create-your-own-Data-Analysis)

## 1. Groupby Aggregation Basics

In [1]:
import pandas as pd
emp = pd.read_csv('../data/employee.csv')
emp.head(3)

,dept,title,hire_date,salary,sex,race
0,Police,POLICE SERGEANT,2001-12-03,87545.38,Male,White
1,Other,ASSISTANT CITY ATTORNEY II,2010-11-15,82182.00,Male,Hispanic
2,Houston Public Works,SENIOR SLUDGE PROCESSOR,2006-01-09,49275.00,Male,Black

### Exercise 1

<span  style="color:green; font-size:16px">Find the maximum salary for each sex.</span>

In [2]:
emp.groupby('sex').agg(max_salary=('salary', 'max'))

        max_salary
sex
Female    342784.0
Male      342784.0

### Exercise 2

<span  style="color:green; font-size:16px">Find the median salary for each department.</span>

In [3]:
emp.groupby('dept').agg(median_salary=('salary', 'median')).head()

                         median_salary
dept
Fire                          61921.08
Health & Human Services       50773.00
Houston Airport System        44200.00
Houston Public Works          46841.50
Library                       34611.00

### Exercise 3

<span style="color:green; font-size:16px">Find the average salary for each race. Return a DataFrame with the race as a column.</span>

In [4]:
emp.groupby('race').agg(avg_salary=('salary', 'mean')).round(-3).reset_index()

              race  avg_salary
0            Asian     65000.0
1            Black     52000.0
2         Hispanic     55000.0
3  Native American     58000.0
4            White     67000.0

### Exercise 4

<span style="color:green; font-size:16px">Find the number of employees in each department.</span>

It's not necessary to use a groupby.

In [5]:
emp['dept'].value_counts()

Police                     7573
Fire                       4376
Houston Public Works       4190
Other                      3373
Health & Human Services    1353
Houston Airport System     1216
Parks & Recreation         1152
Library                     563
Solid Waste Management      512
Name: dept, dtype: int64

If you do use a groupby, it doesn't matter what column you use, but you must use `size` and not `count` because `count` will not count missing values. It is possible to use the grouping column as the aggregating column.

In [6]:
emp.groupby('dept').agg(num_employees=('dept', 'size'))

                         num_employees
dept
Fire                              4376
Health & Human Services           1353
Houston Airport System            1216
Houston Public Works              4190
Library                            563
Other                             3373
Parks & Recreation                1152
Police                            7573
Solid Waste Management             512

### Exercise 5

<span style="color:green; font-size:16px">Find the number of unique titles there are for each department.</span>

In [7]:
emp.groupby('dept').agg(unique_titles=('title', 'nunique'))

                         unique_titles
dept
Fire                                77
Health & Human Services            161
Houston Airport System             137
Houston Public Works               215
Library                             66
Other                              358
Parks & Recreation                 109
Police                             145
Solid Waste Management              44

### Exercise 6

<span style="color:green; font-size:16px">Find the index of the employee with the maximum salary for each department and then use those index values to select their entire rows from the original DataFrame.</span>

In [8]:
df = emp.groupby('dept').agg(idx_sal=('salary', 'idxmax'))
df

                         idx_sal
dept
Fire                        1732
Health & Human Services     8405
Houston Airport System      3897
Houston Public Works       10704
Library                     7564
Other                      13338
Parks & Recreation         11679
Police                      4413
Solid Waste Management     20244

In [9]:
idx = df['idx_sal']
emp.loc[idx]

,dept,title,hire_date,salary,sex,race
1732,Fire,"PHYSICIAN,MD",2014-09-27,342784.0,Male,White
8405,Health & Human Services,"CHIEF PHYSICIAN,MD",2017-07-31,186685.0,Female,White
3897,Houston Airport System,AVIATION DIRECTOR,2010-06-01,275000.0,Male,Hispanic
10704,Houston Public Works,PUBLIC WORKS DIRECTOR,2005-08-10,275000.0,Female,White
7564,Library,LIBRARY DIRECTOR,2005-11-07,170000.0,Female,Black
13338,Other,CITY ATTORNEY,2016-05-02,275000.0,Male,Black
11679,Parks & Recreation,PARKS & RECREATION DIRECTOR,2017-07-05,150000.0,Male,White
4413,Police,POLICE CHIEF,2016-11-30,280000.0,Male,Hispanic
20244,Solid Waste Management,SOLID WASTE DIRECTOR,2001-05-14,195000.0,Male,Black

### Use the NYC deaths dataset for the remaining exercises

Execute the cell below to read in the NYC deaths dataset and use it to answer the following exercises.

In [10]:
deaths = pd.read_csv('../data/nyc_deaths.csv')
deaths.head(3)

   year      cause sex      race  deaths
0  2007  Accidents   F     Asian      32
1  2007  Accidents   F     Black      87
2  2007  Accidents   F  Hispanic      71

### Exercise 7

<span style="color:green; font-size:16px">What year had the most deaths?</span>

In [11]:
year_deaths = deaths.groupby('year').agg(total=('deaths', 'sum'))
year_deaths

      total
year
2007  53996
2008  54138
2009  52820
2010  52505
2011  52726
2012  52420
2013  53387
2014  53006

In [12]:
year_deaths.agg(['max', 'idxmax'])

        total
max     54138
idxmax   2008

### Exercise 8

<span  style="color:green; font-size:16px">Find the total number of deaths by race and sort by most to least.</span>

In [13]:
deaths.groupby('race').agg(total=('deaths', 'sum')).sort_values('total', ascending=False)

           total
race
White     206487
Black     111116
Hispanic   74802
Asian      26355
Unknown     6238

### Exercise 9

<span  style="color:green; font-size:16px">Find the total number of deaths by cause and then select the five highest causes.</span>

In [14]:
deaths.groupby('cause').agg(total=('deaths', 'sum')).nlargest(5, 'total')

                    total
cause
Heart Disease      147551
Cancer             106367
Other               77999
Flu and Pneumonia   18678
Diabetes            13794

## 2. Grouping and Aggregating with Multiple Columns

Execute the following cell to read in the City of Houston employee data and use it for the first few exercises.

In [15]:
import pandas as pd
emp = pd.read_csv('../data/employee.csv', parse_dates=['hire_date'])
emp.head(3)

,dept,title,hire_date,salary,sex,race
0,Police,POLICE SERGEANT,2001-12-03,87545.38,Male,White
1,Other,ASSISTANT CITY ATTORNEY II,2010-11-15,82182.00,Male,Hispanic
2,Houston Public Works,SENIOR SLUDGE PROCESSOR,2006-01-09,49275.00,Male,Black

### Exercise 1

<span  style="color:green; font-size:16px">For each department and sex, find the number of unique position titles, the total number of employees, and the average salary. Make sure there is no multi-level index.</span>

In [16]:
data = emp.groupby(['dept', 'sex']).agg(num_unique_titles=('title', 'nunique'),
                                        num_employees=('title', 'size'),
                                        avg_salaray=('salary', 'mean')).reset_index()
data.head(10)

,dept,sex,num_unique_titles,num_employees,avg_salaray
0,Fire,Female,51,240,62212.637250
1,Fire,Male,54,4136,60479.306862
2,Health & Human Services,Female,136,987,53838.310780
3,Health & Human Services,Male,110,366,59230.425956
4,Houston Airport System,Female,85,443,51099.300226
5,Houston Airport System,Male,113,773,57278.306598
6,Houston Public Works,Female,151,1195,51294.453004
7,Houston Public Works,Male,180,2995,51490.113309
8,Library,Female,55,404,41126.962921
9,Library,Male,44,159,44399.943396

### Exercise 2

<span  style="color:green; font-size:16px">For each department, race, and sex find the min and max and salaries.</span>

In [17]:
emp.groupby(['dept','race', 'sex']).agg(min_salary=('salary', 'min'),
                                          max_salary=('salary', 'max')).head(10)

                             min_salary  max_salary
dept race            sex
Fire Asian           Female     39104.0   342784.00
                     Male       28024.0   342784.00
     Black           Female     16411.0   342784.00
                     Male       28024.0   342784.00
     Hispanic        Female     28024.0    89590.02
                     Male       26000.0   342784.00
     Native American Female     48189.7    70181.28
                     Male       28024.0   115835.98
     White           Female     16910.0   342784.00
                     Male       16515.0   342784.00

Execute the following cell to read in the college dataset and use it for the remaining exercises.

In [18]:
pd.set_option('display.max_columns', 100)
college = pd.read_csv('../data/college.csv')
college.head(3)

,instnm,city,stabbr,hbcu,menonly,womenonly,relaffil,satvrmid,satmtmid,distanceonly,ugds,ugds_white,ugds_black,ugds_hisp,ugds_asian,ugds_aian,ugds_nhpi,ugds_2mor,ugds_nra,ugds_unkn,pptug_ef,curroper,pctpell,pctfloan,ug25abv,md_earn_wne_p10,grad_debt_mdn_supp
0,Alabama A & M University,Normal,AL,1.0,0.0,0.0,0,424.0,420.0,0.0,4206.0,0.0333,0.9353,0.0055,0.0019,0.0024,0.0019,0.0000,0.0059,0.0138,0.0656,1,0.7356,0.8284,0.1049,30300,33888
1,University of Alabama at Birmingham,Birmingham,AL,0.0,0.0,0.0,0,570.0,565.0,0.0,11383.0,0.5922,0.2600,0.0283,0.0518,0.0022,0.0007,0.0368,0.0179,0.0100,0.2607,1,0.3460,0.5214,0.2422,39700,21941.5
2,Amridge University,Montgomery,AL,0.0,0.0,0.0,1,NaN,NaN,1.0,291.0,0.2990,0.4192,0.0069,0.0034,0.0000,0.0000,0.0000,0.0000,0.2715,0.4536,1,0.6801,0.7795,0.8540,40100,23370

### Exercise 3

<span  style="color:green; font-size:16px">Which city name appears the most frequently. Do this in two different ways. Do it once with and once without the `groupby` method?</span>

In [19]:
size = college.groupby('city').agg(size=('stabbr', 'size'))
size.head()

          size
city
Aberdeen     3
Abilene      5
Abingdon     2
Abington     1
Ada          3

In [20]:
size.sort_values('size', ascending=False).head()

             size
city
New York       87
Chicago        78
Houston        72
Los Angeles    56
Miami          51

Can call `idxmax` directly.

In [21]:
college.groupby('city').agg(size=('stabbr', 'size')).idxmax()

size    New York
dtype: object

### Without groupby

Use `value_counts`

In [22]:
college['city'].value_counts().head()

New York       87
Chicago        78
Houston        72
Los Angeles    56
Miami          51
Name: city, dtype: int64

### Exercise 4

<span style="color:green; font-size:16px">Does the city 'Houston' only appear in the state of Texas (abbreviated 'TX')?</span>

NO! It also appears in Missouri.

In [23]:
filt = college['city'] == 'Houston'
college.loc[filt, 'stabbr'].unique()

array(['TX', 'MO'], dtype=object)

Can see exact counts

In [24]:
college.loc[filt, 'stabbr'].value_counts()

TX    71
MO     1
Name: stabbr, dtype: int64

You can use a groupby and find the number of unique states for each city. This is not very efficient.

In [25]:
city_unique_state = college.groupby('city').agg(num_unique_states=('stabbr', 'nunique'))
city_unique_state.head()

          num_unique_states
city
Aberdeen                  2
Abilene                   1
Abingdon                  1
Abington                  1
Ada                       2

In [26]:
city_unique_state.loc['Houston']

num_unique_states    2
Name: Houston, dtype: int64

Also with `drop_duplicates`

In [27]:
college[['city', 'stabbr']].query('city == "Houston"') \
                           .drop_duplicates(subset='stabbr')

         city stabbr
3617  Houston     TX
5366  Houston     MO

### Exercise 5

<span style="color:green; font-size:16px">Find the maximum undergraduate population for each state?</span>

In [28]:
college.groupby('stabbr').agg(max_ugds=('ugds', 'max')).head(10)

        max_ugds
stabbr
AK       12865.0
AL       29851.0
AR       21405.0
AS        1276.0
AZ      151558.0
CA       44744.0
CO       25873.0
CT       18016.0
DC       10433.0
DE       18222.0

### Exercise 6

<span style="color:green; font-size:16px">Find the largest college from each state. From those colleges, find the difference between the largest and smallest.</span>

In [29]:
largest_per_state = college.groupby('stabbr').agg(max_ugds=('ugds', 'max'))
largest_per_state.max() - largest_per_state.min()

max_ugds    150956.0
dtype: float64

### Exercise 7

<span style="color:green; font-size:16px">Find the name and population of the largest college per state.</span>

Find the index of the maximum college per state first.

In [30]:
ugds_idx = college.groupby('stabbr').agg(idx=('ugds', 'idxmax'))
ugds_idx.head()

         idx
stabbr
AK        60
AL         5
AR       137
AS      4138
AZ      7116

In [31]:
idx = ugds_idx['idx']
idx.head()

stabbr
AK      60
AL       5
AR     137
AS    4138
AZ    7116
Name: idx, dtype: int64

Use the index to select the desired rows.

In [32]:
college.loc[idx, ['stabbr', 'instnm', 'ugds']].head(10)

     stabbr                            instnm      ugds
60       AK    University of Alaska Anchorage   12865.0
5        AL         The University of Alabama   29851.0
137      AR            University of Arkansas   21405.0
4138     AS  American Samoa Community College    1276.0
7116     AZ     University of Phoenix-Arizona  151558.0
1299     CA                Ashford University   44744.0
574      CO    University of Colorado Boulder   25873.0
641      CT         University of Connecticut   18016.0
701      DC      George Washington University   10433.0
691      DE            University of Delaware   18222.0

Second method - set the index first to be instnm so that you can take advantage of idxmax

In [33]:
c2 = college.set_index('instnm')
max_indexes = c2.groupby('stabbr').agg(max_ugds_college=('ugds', 'idxmax'),
                                       max_ugds=('ugds', 'max'))
max_indexes.head()

                        max_ugds_college  max_ugds
stabbr
AK        University of Alaska Anchorage   12865.0
AL             The University of Alabama   29851.0
AR                University of Arkansas   21405.0
AS      American Samoa Community College    1276.0
AZ         University of Phoenix-Arizona  151558.0

Third method - Sort the data first, then sse the `first` groupby method to return the first row of each group after sorting.

In [34]:
college.sort_values('ugds', ascending=False).groupby('stabbr') \
        .agg(max_ugds_college=('instnm', 'first'), 
             max_ugds=('ugds', 'first')).head()

                        max_ugds_college  max_ugds
stabbr
AK        University of Alaska Anchorage   12865.0
AL             The University of Alabama   29851.0
AR                University of Arkansas   21405.0
AS      American Samoa Community College    1276.0
AZ         University of Phoenix-Arizona  151558.0

Fourth method - Done previously without grouping

In [35]:
college.sort_values(['stabbr', 'ugds'], ascending=[True, False]) \
       .drop_duplicates(subset='stabbr')[['stabbr', 'instnm', 'ugds']] \
       .head()

     stabbr                            instnm      ugds
60       AK    University of Alaska Anchorage   12865.0
5        AL         The University of Alabama   29851.0
137      AR            University of Arkansas   21405.0
4138     AS  American Samoa Community College    1276.0
7116     AZ     University of Phoenix-Arizona  151558.0

### Exercise 8

<span  style="color:green; font-size:16px">Do distance only schools tend to have more or less student population than non-distance-only schools?</span>

In [36]:
# They have more
college.groupby('distanceonly').agg(mean_ugds=('ugds', 'mean'))

                mean_ugds
distanceonly
0.0           2334.648135
1.0           6245.743590

### Exercise 9

<span style="color:green; font-size:16px">Do distance only schools tend to be more or less religiously affiliated than non-distance-only schools?</span>

In [37]:
# Less
college.groupby('distanceonly').agg(mean_relaffil=('relaffil', 'mean'))

              mean_relaffil
distanceonly
0.0                0.149635
1.0                0.050000

### Exercise 10

<span  style="color:green; font-size:16px">What state has the lowest percentage of currently operating schools of those that have religious affiliation?</span>

In [38]:
rel_oper_mean = college.query('relaffil == 1') \
                       .groupby('stabbr').agg(mean_curroper=('curroper', 'mean')) \
                       .round(2)
rel_oper_mean.head()

        mean_curroper
stabbr
AK               1.00
AL               0.92
AR               0.94
AZ               0.44
CA               0.59

In [39]:
rel_oper_mean.sort_values('mean_curroper').head()

        mean_curroper
stabbr
UT               0.40
AZ               0.44
NV               0.50
CA               0.59
CT               0.65

### Exercise 11

<span  style="color:green; font-size:16px">Find the top 5 historically black colleges that have the highest undergraduate white percentage (ugds_white)?</span>

In [40]:
filt = college['hbcu'] == 1
cols = ['instnm', 'ugds_white']
college.loc[filt, cols].sort_values('ugds_white', ascending=False).head()

                                           instnm  ugds_white
4021                      Bluefield State College      0.8437
17                Gadsden State Community College      0.6921
4050               West Virginia State University      0.5816
48                Shelton State Community College      0.5613
55    H Councill Trenholm State Community College      0.3951

## 3. Grouping with Pivot Tables

In [41]:
import pandas as pd
flights = pd.read_csv('../data/flights.csv', parse_dates=['date'])
flights.insert(1, 'day_of_week', flights['date'].dt.day_name())
flights.insert(2, 'month', flights['date'].dt.month_name())
flights.head(3)

,date,day_of_week,month,airline,origin,dest,dep_time,arr_time,cancelled,air_time,distance,carrier_delay,weather_delay,nas_delay,security_delay,late_aircraft_delay
0,2018-01-01,Monday,January,UA,LAS,IAH,100,547,0,134.0,1222.0,0,0,0,0,0
1,2018-01-01,Monday,January,WN,DEN,PHX,515,720,0,91.0,602.0,0,0,0,0,0
2,2018-01-01,Monday,January,B6,JFK,BOS,550,657,0,39.0,187.0,0,83,8,0,0

In [42]:
flights.shape

(65923, 16)

### Exercise 1

<span style="color:green; font-size:16px">What is the average carrier delay for each day of the week for each airline? Highlight the worst day of the week for each airline.</span>

In [43]:
avg_delay = flights.pivot_table(index='airline', columns='day_of_week', 
                                values='carrier_delay').round(1)
avg_delay.style.highlight_max(axis='columns')

You can highlight min and max by chaining style methods.

In [44]:
avg_delay.style.highlight_max(axis='columns') \
         .highlight_min(axis='columns', color='lightblue')

### Exercise 2

<span style="color:green; font-size:16px">Use a pivot table to find the total number of canceled flights for each origin airport and airline. Place the airlines in the columns. Use the result to find the origin airport with the most cancelled flights for each airline. Also return this maximum number of cancelled flights.</span>

In [45]:
airline_cancel = flights.pivot_table(index='origin', columns='airline', 
                                     values='cancelled', aggfunc='sum', fill_value=0)
airline_cancel.head(10)

airline  9E  AA  AS  B6  DL  EV  F9  MQ  NK  OH  OO  UA  VX  WN  YV  YX
origin
ATL       0   5   0   2  19   0   0   0   5   1   1   2   0   8   4   9
BOS       5  41   1  31   9   0   0   1   5   0   0  18   0   2   0  12
CLT       6  33   0   2   1   2   1   0   0   4   0   0   0   0   0  11
DCA       1  27   0   3   3   5   1   0   0   2   1   2   0   6   0  31
DEN       0   3   1   0   0   0   3   0   1   0   0  10   0   9   0   0
DFW       1  33   0   0   1   0   0   1   3   0   1   1   0   0   1   7
DTW       1   4   0   3   8   0   0   4   1   2   4   0   0   1   1   8
EWR       2  10   6   8   0   0   0   3   1   0   2  27   1   1   0  15
IAH       0   7   0   0   1   0   0   1   4   0   3   7   0   0   4   4
JFK      10   6   3  17   3   0   0   0   0   0   0   0   1   0   0   4

In [46]:
airline_cancel.agg(['max', 'idxmax'])

,9E,AA,AS,B6,DL,EV,F9,MQ,NK,OH,OO,UA,VX,WN,YV,YX
max,10,41,9,31,19,5,3,5,5,4,14,27,6,18,4,31
idxmax,JFK,BOS,SEA,BOS,ATL,DCA,DEN,LGA,ATL,CLT,ORD,EWR,LAX,LAX,ATL,DCA

### Exercise 3

<span style="color:green; font-size:16px">Find the total distance flown for each airline for each month. Highlight the month with the most number of miles flown and use the style `format` method to put commas in the numbers so that they are easier to read.</span>

In [47]:
total_dist = flights.pivot_table(index='airline', columns='month', 
                                 values='distance', aggfunc='sum')
total_dist.style.format('{:,.0f}').highlight_max(axis='columns')

### Exercise 4

<span style="color:green; font-size:16px">Create a pivot table that shows the number of flights flown for every day of the week for every month.</span>

In [48]:
flights.pivot_table(index='month', columns='day_of_week', aggfunc='size')

day_of_week  Friday  Monday  Saturday  Sunday  Thursday  Tuesday  Wednesday
month
April           786     943       644     898       818      755        754
August         1006     785       592     776       982      757        963
December        707     840       750     897       759      634        695
February        748     725       544     639       753      716        719
January         673     862       536     696       739      821        838
July            808     936       677     932       765     1012        780
June           1005     792       817     809       842      779        822
March           974     734       705     687       884      676        751
May             766     798       597     726      1058      913        894
November        887     710       624     737       871      707        709
October         773     961       554     711       790      939        894
September       739     742       742     902       761      719        762

### Exercise 5

<span style="color:green; font-size:16px">In exercise 4, the months and days of week are ordered alphabetically. It would be better if these values were ordered chronologically. Can you return a result that has both groups in the correct order. Use Monday as the first day of the week.</span>

Convert to ordered categorical first overwriting the original columns.

In [49]:
months = ['January', 'February', 'March', 'April', 'May', 'June', 'July',
           'August', 'September', 'October', 'November', 'December']
days =  ['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday',
         'Sunday']
month_dtype = pd.CategoricalDtype(months, ordered=True)
day_dtype = pd.CategoricalDtype(days, ordered=True)
flights = flights.astype({'month': month_dtype, 'day_of_week': day_dtype})

Call the same pivot table and the index and columns will be automatically sorted by their category order.

In [50]:
flights.pivot_table(index='month', columns='day_of_week', aggfunc='size')

day_of_week  Monday  Tuesday  Wednesday  Thursday  Friday  Saturday  Sunday
month
January         862      821        838       739     673       536     696
February        725      716        719       753     748       544     639
March           734      676        751       884     974       705     687
April           943      755        754       818     786       644     898
May             798      913        894      1058     766       597     726
June            792      779        822       842    1005       817     809
July            936     1012        780       765     808       677     932
August          785      757        963       982    1006       592     776
September       742      719        762       761     739       742     902
October         961      939        894       790     773       554     711
November        710      707        709       871     887       624     737
December        840      634        695       759     707       750     897

### Exercise 6

<span style="color:green; font-size:16px">Create a new column in the flights dataset called `'dep_time_hour'` and set it equal to the hour (this will be an integer 0 through 23) of the flight. Find the average carrier delay for every month and dep_time_hour. Place the month in the columns.</span>

In [51]:
flights['dep_time_hour'] = flights['dep_time'] // 100

In [52]:
flights.pivot_table(index='dep_time_hour', columns='day_of_week', 
                    values='carrier_delay', aggfunc='mean').round(1)

day_of_week    Monday  Tuesday  Wednesday  Thursday  Friday  Saturday  Sunday
dep_time_hour
0                 0.2      3.6        1.2       2.4     6.5       1.7     2.4
1                 0.0      0.0        1.1       0.7     0.0       1.7     2.3
2                 NaN      NaN        0.0       NaN     NaN       0.0     0.0
4                 NaN      NaN        NaN       NaN     0.0       NaN     NaN
5                 5.9      1.5        1.8       2.4     4.4       3.0     1.8
6                 2.5      2.8        2.6       2.8     5.2       4.0     3.5
7                 2.0      3.5        1.8       3.7     3.8       4.1     1.8
8                 3.6      3.1        7.2       4.3     2.3       4.0     3.7
9                 3.1      2.8        2.5       3.8     3.3       3.4     3.0
10                2.8      2.9        2.1       3.4     3.3       3.2     2.1
11                3.8      3.4        2.0       2.0     2.5       1.6     3.3
12                3.1      4.0        3.1       4.1     3.0       4.2     4.3
13                2.3      3.6        3.1       2.8     4.7       2.6     2.9
14                3.0      4.1        2.3       5.0     1.9       3.6     3.1
15                3.1      3.5        3.0       4.9     3.8       3.7     4.7
16                3.0      3.3        2.5       4.6     3.8       3.8     3.2
17                4.3      3.7        4.9       4.4     3.4       3.2     5.0
18                4.1      4.3        2.9       9.4     2.8       5.3     4.1
19                2.9      2.6        2.9       4.7     6.8       3.3     6.3
20                5.3      4.3        4.2       4.8     4.8       4.1     4.3
21                2.6      6.1        3.4       7.6     6.7       3.4     4.5
22                4.2      7.6        4.5       4.4     6.1       2.5     5.6
23                5.1      2.4        0.9       4.2    10.9      10.3     2.6

### Exercise 7

<span style="color:green; font-size:16px">Use both `groupby` and `pivot_table` to compute the average and median distance flown by day of the week.</span>

In [53]:
flights.groupby('day_of_week').agg(median_dist=('distance', 'median'),
                                   mean_dist=('distance', 'mean')) \
       .style.format('{:,.0f}')

In [54]:
flights.pivot_table(index='day_of_week', values='distance', 
                    aggfunc=['median', 'mean']).style.format('{:,.0f}')

## 4. Counting with Crosstabs

In [55]:
import pandas as pd
pd.options.display.max_columns = 100
pd.options.display.max_colwidth = 200
mh = pd.read_csv('../data/mental_health.csv')
mh.head(3)

,year,age,gender,country,family_history,treatment,work_interfere,no_employees,tech_company,benefits,care_options,wellness_program,seek_help,anonymity,leave,mental_health_consequence,phys_health_consequence,coworkers,supervisor
0,2014,37,Female,United States,No,Yes,Often,6-25,Yes,Yes,Not sure,No,Yes,Yes,Somewhat easy,No,No,Some of them,Yes
1,2014,44,Male,United States,No,No,Rarely,More than 1000,No,Don't know,No,Don't know,Don't know,Don't know,Don't know,Maybe,No,No,No
2,2014,32,Male,Canada,No,No,Rarely,6-25,Yes,No,No,No,No,Don't know,Somewhat difficult,No,No,Yes,Yes

### Exercise 1
<span  style="color:green; font-size:16px">Do people with a family history of mental illness seek treatment more often than those who do not?</span>

In [56]:
pd.crosstab(index=mh['family_history'], columns=mh['treatment'])

treatment        No  Yes
family_history
No              414  241
Yes             111  325

In [57]:
pd.crosstab(index=mh['family_history'], columns=mh['treatment'], normalize='index').round(2)

treatment         No   Yes
family_history
No              0.63  0.37
Yes             0.25  0.75

Yes, there is a large difference. 75% of people with a family history seek treatment vs 37% for those who have not.

### Exercise 2
<span  style="color:green; font-size:16px">Find the total number and ratio of employees that seek treatment for companies that provide health benefits vs those that do not.</span>

In [58]:
pd.crosstab(index=mh['benefits'], columns=mh['treatment'])

treatment    No  Yes
benefits
Don't know  225  134
No          142  150
Yes         158  282

In [59]:
pd.crosstab(index=mh['benefits'], columns=mh['treatment'], normalize='index').round(2)

treatment     No   Yes
benefits
Don't know  0.63  0.37
No          0.49  0.51
Yes         0.36  0.64

### Exercise 3
<span  style="color:green; font-size:16px">You can provide a list of multiple columns to both the `index` and `columns` parameters of the `crosstab` function. Put country and number of employees in the index and benefits and treatment in the columns. It's probably easier to make separate list variables first.</span>

In [60]:
index = [mh['country'], mh['no_employees']]
columns = [mh['benefits'], mh['treatment']]
pd.crosstab(index=index, columns=columns)

benefits                      Don't know      No     Yes
treatment                             No Yes  No Yes  No Yes
country        no_employees
Australia      1-5                     1   0   1   1   0   0
               100-500                 1   0   1   2   0   2
               26-100                  0   0   1   3   0   0
               500-1000                1   0   0   0   0   0
               6-25                    0   1   0   3   0   0
               More than 1000          1   0   0   0   1   1
Canada         1-5                     1   0   5   5   0   0
               100-500                 2   3   0   0   1   3
               26-100                  4   4   2   1   3   3
               500-1000                0   0   0   0   0   1
               6-25                    4   2   6   1   3   5
               More than 1000          0   2   0   0   2   5
France         100-500                 1   0   1   0   0   0
               26-100                  0   0   3   0   0   0
               500-1000                1   0   0   0   1   0
               6-25                    1   0   3   0   0   0
Germany        1-5                     0   0   3   3   0   1
               100-500                 1   2   1   0   0   0
               26-100                  2   4   4   3   1   0
               500-1000                1   0   0   0   1   0
               6-25                    5   1   3   2   0   2
               More than 1000          2   1   0   0   0   0
Ireland        1-5                     1   0   5   4   0   0
               100-500                 1   0   0   1   0   0
               26-100                  0   1   2   3   0   0
               500-1000                0   0   0   0   0   1
               6-25                    0   0   1   2   0   0
               More than 1000          2   0   1   0   1   1
Netherlands    1-5                     2   2   1   2   0   1
               100-500                 1   0   0   0   1   1
               26-100                  1   0   2   1   0   0
               500-1000                1   0   0   0   0   0
               6-25                    1   1   7   1   0   0
               More than 1000          0   0   0   0   1   0
United Kingdom 1-5                     6   3   7  13   0   1
               100-500                 5   6   2   3   2   1
               26-100                 11   5   7  10   3   2
               500-1000                2   3   1   0   1   0
               6-25                   11   7  23  13   1   1
               More than 1000          5   4   3   7   0   8
United States  1-5                    11   4  16  30   3   8
               100-500                21  14   3   8  23  41
               26-100                 41  26   7   6  18  61
               500-1000                8   1   1   1   9  20
               6-25                   30  22  14  19  17  25
               More than 1000         35  15   5   2  65  87

## 5. Alternate Groupby Syntax

## 6. Custom Aggregation

Execute the cell below to read in the flights dataset and then use it for the following exercises.

In [61]:
import pandas as pd
flights = pd.read_csv('../data/flights.csv', parse_dates=['date'])
flights.head(3)

,date,airline,origin,dest,dep_time,arr_time,cancelled,air_time,distance,carrier_delay,weather_delay,nas_delay,security_delay,late_aircraft_delay
0,2018-01-01,UA,LAS,IAH,100,547,0,134.0,1222.0,0,0,0,0,0
1,2018-01-01,WN,DEN,PHX,515,720,0,91.0,602.0,0,0,0,0,0
2,2018-01-01,B6,JFK,BOS,550,657,0,39.0,187.0,0,83,8,0,0

### Exercise 1

<span style="color:green; font-size:16px">What are the three airlines with the least number of flights?</span>

In [62]:
flights['airline'].value_counts().tail(3)

MQ    373
OH    257
EV    171
Name: airline, dtype: int64

### Exercise 2

<span style="color:green; font-size:16px">For each airline, find the 75th percentile of flight distance. Use a custom aggregation function.</span>

In [63]:
def per_75(s):
    return s.quantile(.75)

In [64]:
flights.groupby('airline').agg(dist_75=('distance', per_75))

         dist_75
airline
9E         852.0
AA        1558.0
AS        2402.0
B6        2381.0
DL        1587.0
EV         514.5
F9        1476.0
MQ         612.0
NK        1379.0
OH         500.0
OO         912.0
UA        1635.0
VX        2475.0
WN        1024.0
YV        1075.0
YX         912.0

### Exercise 3

<span style="color:green; font-size:16px">For each airline, find out what percentage of its flights leave on a Tuesday. Use a custom aggregation function.</span>

In [65]:
def tuesday_pct(s):
    return (s.dt.day_name() == 'Tuesday').mean()

flights.groupby('airline').agg(percent_tuesday=('date', tuesday_pct)).round(3) * 100

         percent_tuesday
airline
9E                  14.5
AA                  14.6
AS                  13.8
B6                  13.5
DL                  14.4
EV                  15.8
F9                  12.9
MQ                  16.1
NK                  12.8
OH                  16.7
OO                  14.3
UA                  14.0
VX                  13.3
WN                  15.3
YV                  13.9
YX                  15.0

### Exercise 4

<span style="color:green; font-size:16px">Optimize exercise 2 without using a custom aggregation. What is the performance difference?</span>

In [66]:
flights['airline_cat'] = flights['airline'].astype('category')
flights['is_tuesday'] = flights['date'].dt.day_name() == 'Tuesday'
flights.groupby('airline_cat')['is_tuesday'].mean().round(3) * 100

airline_cat
9E    14.5
AA    14.6
AS    13.8
B6    13.5
DL    14.4
EV    15.8
F9    12.9
MQ    16.1
NK    12.8
OH    16.7
OO    14.3
UA    14.0
VX    13.3
WN    15.3
YV    13.9
YX    15.0
Name: is_tuesday, dtype: float64

About 50% improvement

In [67]:
%timeit -r 1 -n 5 flights.groupby('airline').agg(percent_tuesday=('date', tuesday_pct))

49.8 ms ± 0 ns per loop (mean ± std. dev. of 1 run, 5 loops each)

In [68]:
%%timeit -r 1 -n 5
flights['is_tuesday'] = flights['date'].dt.day_name() == 'Tuesday'
flights.groupby('airline_cat')['is_tuesday'].mean().round(3) * 100

22.1 ms ± 0 ns per loop (mean ± std. dev. of 1 run, 5 loops each)

### Exercise 5

<span style="color:green; font-size:16px">The range of salaries per department was calculated using the `min_max` custom function from the beginning of this chapter. Use this same function to calculate the range of distance for each airline. Then calculate this range again without a custom function.</span>

In [69]:
def min_max(s):
    return s.max() - s.min()

In [70]:
flights.groupby('airline').agg(dist_range=('distance', min_max))

         dist_range
airline
9E           1297.0
AA           2515.0
AS           2468.0
B6           2520.0
DL           2610.0
EV            876.0
F9           2042.0
MQ            831.0
NK           2166.0
OH            835.0
OO           1405.0
UA           2505.0
VX           2468.0
WN           1940.0
YV           1192.0
YX           1320.0

In [71]:
d_max = flights.groupby('airline')['distance'].max()
d_min = flights.groupby('airline')['distance'].min()
d_max - d_min

airline
9E    1297.0
AA    2515.0
AS    2468.0
B6    2520.0
DL    2610.0
EV     876.0
F9    2042.0
MQ     831.0
NK    2166.0
OH     835.0
OO    1405.0
UA    2505.0
VX    2468.0
WN    1940.0
YV    1192.0
YX    1320.0
Name: distance, dtype: float64

Alternatively, create an entire DataFrame.

In [72]:
dist_min_max = flights.groupby('airline').agg(max_dist=('distance', 'max'),
                                              min_dist=('distance', 'min'))
dist_min_max['dist range'] = dist_min_max['max_dist'] - dist_min_max['min_dist']
dist_min_max

         max_dist  min_dist  dist range
airline
9E         1391.0      94.0      1297.0
AA         2611.0      96.0      2515.0
AS         2704.0     236.0      2468.0
B6         2704.0     184.0      2520.0
DL         2704.0      94.0      2610.0
EV         1075.0     199.0       876.0
F9         2446.0     404.0      2042.0
MQ          925.0      94.0       831.0
NK         2402.0     236.0      2166.0
OH          931.0      96.0       835.0
OO         1589.0     184.0      1405.0
UA         2704.0     199.0      2505.0
VX         2704.0     236.0      2468.0
WN         2176.0     236.0      1940.0
YV         1416.0     224.0      1192.0
YX         1416.0      96.0      1320.0

### Exercise 6

<span style="color:green; font-size:16px">Which origin airport has the highest percentage of its flights cancelled?</span>

In [73]:
# no custom aggregation function needed
flights.groupby('origin').agg(pct_cancelled=('cancelled', 'mean')) \
       .nlargest(1, 'pct_cancelled').round(3) * 100

        pct_cancelled
origin
BOS               3.4

### Use the college dataset

Execute the following cell which reads in a few columns from the college dataset, sets the institution name as the index and converts 'stabbr' and 'relaffil' to categorical.

In [74]:
cols = ['instnm', 'stabbr', 'relaffil', 'satvrmid', 'satmtmid', 'ugds']
college = pd.read_csv('../data/college.csv', usecols=cols, 
                      index_col='instnm', dtype={'stabbr': 'category', 
                                                 'relaffil': 'category'})
college.head(3)

,stabbr,relaffil,satvrmid,satmtmid,ugds
instnm,,,,,
Alabama A & M University,AL,0,424.0,420.0,4206.0
University of Alabama at Birmingham,AL,0,570.0,565.0,11383.0
Amridge University,AL,1,NaN,NaN,291.0

### Exercise 7

<span style="color:green; font-size:16px">How many states have more schools with a higher 'satvrmid' than 'satmtmid'? Make sure to not count schools that have missing values for either one.</span>

Make a new DataFrame that drops rows when one of the sat columns is missing.

In [75]:
col_has_sat = college.dropna(subset=['satvrmid', 'satmtmid']).copy()
col_has_sat.head(3)

,stabbr,relaffil,satvrmid,satmtmid,ugds
instnm,,,,,
Alabama A & M University,AL,0,424.0,420.0,4206.0
University of Alabama at Birmingham,AL,0,570.0,565.0,11383.0
University of Alabama in Huntsville,AL,0,595.0,590.0,5451.0

Only a fraction of the schools have both scores.

In [76]:
len(col_has_sat)

1184

In [77]:
len(college)

7535

Create a new boolean column that determines which score is higher.

In [78]:
col_has_sat['higher_verbal'] = col_has_sat['satvrmid'] > col_has_sat['satmtmid']
col_has_sat.head(3)

,stabbr,relaffil,satvrmid,satmtmid,ugds,higher_verbal
instnm,,,,,,
Alabama A & M University,AL,0,424.0,420.0,4206.0,True
University of Alabama at Birmingham,AL,0,570.0,565.0,11383.0,True
University of Alabama in Huntsville,AL,0,595.0,590.0,5451.0,True

Group by state to determine percentage with higher verbal. Only those greater than .5 have more verbal than math.

In [79]:
avg_verbal_higher = col_has_sat.groupby('stabbr')['higher_verbal'].mean()
avg_verbal_higher.sort_values(ascending=False).head(10)

stabbr
AK    1.000000
VI    1.000000
GA    0.690476
FL    0.684211
OR    0.588235
AL    0.571429
VA    0.564103
MN    0.560000
AZ    0.500000
DC    0.500000
Name: higher_verbal, dtype: float64

Technically, have to check for ties. No custom function needed.

In [80]:
(avg_verbal_higher > .5).sum()

8

### Exercise 8

<span style="color:green; font-size:16px">Create a pivot table that shows the percentage of schools with less than 1,000 students in each state by religious affiliation. Also return the count of schools.</span>

In [81]:
def less_1k(s):
    return (s < 1_000).mean().round(3) * 100

In [82]:
result = college.pivot_table(index='stabbr', columns='relaffil', values='ugds', 
                             aggfunc=[less_1k, 'count'])
result.head(10)

         less_1k         count
relaffil       0      1      0     1
stabbr
AK          42.9  100.0    7.0   3.0
AL          44.4   37.5   71.0  18.0
AR          58.8   61.1   68.0  14.0
AS           0.0    NaN    1.0   NaN
AZ          63.7   77.8  118.0   8.0
CA          61.4   27.4  579.0  76.0
CO          64.4   28.6  113.0   4.0
CT          58.8   23.5   82.0   7.0
DC          52.9    0.0   14.0   4.0
DE          75.0    0.0   16.0   3.0

## 7. Transform and Filter with Groupby

Execute the cell below to reread the college dataset and use it for the exercises below.

In [83]:
import pandas as pd
cols = ['instnm', 'stabbr', 'relaffil', 'satvrmid', 'satmtmid', 'ugds']
college = pd.read_csv('../data/college.csv', usecols=cols, index_col='instnm')
college.head(3)

,stabbr,relaffil,satvrmid,satmtmid,ugds
instnm,,,,,
Alabama A & M University,AL,0,424.0,420.0,4206.0
University of Alabama at Birmingham,AL,0,570.0,565.0,11383.0
Amridge University,AL,1,NaN,NaN,291.0

### Exercise 1

<span style="color:green; font-size:16px">Filter the college DataFrame for states that have more than 500,000 total undergraduate students. Can you verify your results?</span>

In [84]:
def filt_500k(sub_df):
    return sub_df['ugds'].sum() > 500_000

college_large = college.groupby('stabbr').filter(filt_500k)
college_large.head()

,stabbr,relaffil,satvrmid,satmtmid,ugds
instnm,,,,,
Prince Institute-Southeast,IL,0,NaN,NaN,84.0
Everest College-Phoenix,AZ,1,NaN,NaN,4102.0
Collins College,AZ,0,NaN,NaN,83.0
Empire Beauty School-Paradise Valley,AZ,1,NaN,NaN,25.0
Empire Beauty School-Tucson,AZ,0,NaN,NaN,126.0

In [85]:
college_large.groupby('stabbr').agg(ugds_total=('ugds', 'sum')) \
             .sort_values('ugds_total', ascending=False).round(-3)

        ugds_total
stabbr
CA       2304000.0
TX       1277000.0
NY        994000.0
FL        960000.0
PA        605000.0
IL        600000.0
OH        538000.0
AZ        520000.0

### Exercise 2

<span style="color:green; font-size:16px">Filter the college DataFrame for states that have a an average undergraduate student population greater than 2,500 and have more than 30 religiously affiliated schools. Can you verify your results?</span>

In [86]:
def func2(sub_df):
    return sub_df['ugds'].mean() > 2_500 and sub_df['relaffil'].sum() > 30

In [87]:
c2 = college.groupby('stabbr').filter(func2)
c2.head(3)

,stabbr,relaffil,satvrmid,satmtmid,ugds
instnm,,,,,
Academy of Art University,CA,0,NaN,NaN,9885.0
ITT Technical Institute-Rancho Cordova,CA,0,NaN,NaN,500.0
Academy of Chinese Culture and Health Sciences,CA,0,NaN,NaN,NaN

In [88]:
c2.groupby('stabbr').agg(mean_ugds=('ugds', 'mean'),
                         num_relaffil=('relaffil', 'sum'))

          mean_ugds  num_relaffil
stabbr
CA      3518.308397           164
GA      2642.571429            37
IN      2653.559055            62
MI      2643.016043            48
TX      2998.530516            96
VA      2694.900000            44

### Exercise 3

<span style="color:green; font-size:16px">The maximum SAT score for each test is 800. Create a new column in the college dataset that shows each school's percentage of maximum for each SAT score.</span>

No need to use transform here.

In [89]:
college['pct_max_sat_verbal'] = (college['satvrmid'] / 800).round(3) * 100
college['pct_max_sat_math'] = (college['satmtmid'] / 800).round(3) * 100
college.head(3)

,stabbr,relaffil,satvrmid,satmtmid,ugds,pct_max_sat_verbal,pct_max_sat_math
instnm,,,,,,,
Alabama A & M University,AL,0,424.0,420.0,4206.0,53.0,52.5
University of Alabama at Birmingham,AL,0,570.0,565.0,11383.0,71.2,70.6
Amridge University,AL,1,NaN,NaN,291.0,NaN,NaN

### Use the City of Houston dataset

Execute the following cell to read in the City of Houston employee dataset and then use it for the following exercises.

In [90]:
emp = pd.read_csv('../data/employee.csv')
emp.head(3)

,dept,title,hire_date,salary,sex,race
0,Police,POLICE SERGEANT,2001-12-03,87545.38,Male,White
1,Other,ASSISTANT CITY ATTORNEY II,2010-11-15,82182.00,Male,Hispanic
2,Houston Public Works,SENIOR SLUDGE PROCESSOR,2006-01-09,49275.00,Male,Black

### Exercise 4

<span style="color:green; font-size:16px">Filter it so that only position titles with an average salary of 100,000 remain. Can you verify your results?</span>

In [91]:
high_sal = emp.groupby('title').filter(lambda sub_df: sub_df['salary'].mean() > 100_000)
high_sal.head()

,dept,title,hire_date,salary,sex,race
16,Other,ASSOCIATE JUDGE OF MUNICIPAL COURTS,2005-11-09,107744.00,Male,Hispanic
17,Police,POLICE COMMANDER,1983-02-07,115821.42,Male,White
19,Other,ASSISTANT DIRECTOR (EXECUTIVE LEVEL),2002-05-28,95783.00,Female,Hispanic
39,Houston Airport System,DEPUTY ASSISTANT DIRECTOR (EXECUTIVE LEV,2017-08-15,112270.00,Male,Black
48,Fire,ASSISTANT FIRE CHIEF,1994-11-07,115835.98,Male,Hispanic

In [92]:
high_sal.groupby('title').agg(avg_salary=('salary', 'mean')).min()

avg_salary    100038.0
dtype: float64

### Exercise 5

<span style="color:green; font-size:16px">Filter the employee dataset so that only position titles with at least 5 employees and an average salary of 80,000 remain. Can you verify the results?</span>

In [93]:
def sal_count(sub_df):
    return sub_df['salary'].mean() > 80000 and len(sub_df) >= 5

In [94]:
high_sal_count = emp.groupby('title').filter(sal_count)
high_sal_count.head()

,dept,title,hire_date,salary,sex,race
0,Police,POLICE SERGEANT,2001-12-03,87545.38,Male,White
1,Other,ASSISTANT CITY ATTORNEY II,2010-11-15,82182.00,Male,Hispanic
16,Other,ASSOCIATE JUDGE OF MUNICIPAL COURTS,2005-11-09,107744.00,Male,Hispanic
17,Police,POLICE COMMANDER,1983-02-07,115821.42,Male,White
19,Other,ASSISTANT DIRECTOR (EXECUTIVE LEVEL),2002-05-28,95783.00,Female,Hispanic

In [95]:
high_sal_count.groupby('title').agg(avg_salary=('salary', 'mean'),
                                    size=('salary', 'size')).min()

avg_salary    80153.202222
size              5.000000
dtype: float64

### Exercise 6

<span style="color:green; font-size:16px">Add a column to the DataFrame that contains the median salary based on department, sex, and race.</span>

In [96]:
emp['median_drs'] = emp.groupby(['dept', 'sex', 'race'])['salary'].transform('median')
emp.head()

,dept,title,hire_date,salary,sex,race,median_drs
0,Police,POLICE SERGEANT,2001-12-03,87545.38,Male,White,73479.00
1,Other,ASSISTANT CITY ATTORNEY II,2010-11-15,82182.00,Male,Hispanic,47445.00
2,Houston Public Works,SENIOR SLUDGE PROCESSOR,2006-01-09,49275.00,Male,Black,38813.00
3,Police,SENIOR POLICE OFFICER,1997-05-27,75942.10,Male,Hispanic,68116.62
4,Police,SENIOR POLICE OFFICER,2006-01-23,69355.26,Male,White,73479.00

### Exercise 7

<span  style="color:green; font-size:16px">Add a new column, `pct_max_dept_sex`, to the employee DataFrame that holds the employees percentage of the maximum salary for each department and sex. For instance, if a male HPD employee makes 80,000 and the maximum male HPD salary is 120,000 then the value for this employee would be 80,000/120,000 or .666. Verify this value for the first employee.</span>

In [97]:
def pct_max(sub_series):
    return sub_series / sub_series.max()

In [98]:
emp['pct_max_dept_sex'] = emp.groupby(['dept', 'sex'])['salary'].transform(pct_max)
emp.head()

,dept,title,hire_date,salary,sex,race,median_drs,pct_max_dept_sex
0,Police,POLICE SERGEANT,2001-12-03,87545.38,Male,White,73479.00,0.312662
1,Other,ASSISTANT CITY ATTORNEY II,2010-11-15,82182.00,Male,Hispanic,47445.00,0.298844
2,Houston Public Works,SENIOR SLUDGE PROCESSOR,2006-01-09,49275.00,Male,Black,38813.00,0.227809
3,Police,SENIOR POLICE OFFICER,1997-05-27,75942.10,Male,Hispanic,68116.62,0.271222
4,Police,SENIOR POLICE OFFICER,2006-01-23,69355.26,Male,White,73479.00,0.247697

In [99]:
filt = (emp['dept'] == 'Police') & (emp['sex'] == 'Male')
max_sal = emp.loc[filt, 'salary'].max()
max_sal

280000.0

In [100]:
emp.loc[0, 'salary'] / max_sal

0.31266207142857144

## 8. Other Groupby Methods

Execute the next cell to read in some of the columns from the flights dataset and use it to answer the following exercises.

In [101]:
import pandas as pd
cols = ['date', 'airline', 'origin', 'dest', 'dep_time', 'arr_time',
       'cancelled', 'air_time', 'distance', 'carrier_delay']
flights = pd.read_csv('../data/flights.csv', parse_dates=['date'], usecols=cols)
flights.head(3)

,date,airline,origin,dest,dep_time,arr_time,cancelled,air_time,distance,carrier_delay
0,2018-01-01,UA,LAS,IAH,100,547,0,134.0,1222.0,0
1,2018-01-01,WN,DEN,PHX,515,720,0,91.0,602.0,0
2,2018-01-01,B6,JFK,BOS,550,657,0,39.0,187.0,0

### Exercise 1

<span style="color:green; font-size:16px">For each airline, return the first and last row of each group. Use the `nth` group by method.</span>

In [102]:
flights.groupby('airline').nth([0, -1]).head(8)

,date,origin,dest,dep_time,arr_time,cancelled,air_time,distance,carrier_delay
airline,,,,,,,,,
9E,2018-12-31,CLT,JFK,1400,1603,0,80.0,541.0,0
9E,2018-01-01,IAH,ATL,1346,1651,0,86.0,689.0,0
AA,2018-01-01,DFW,DCA,610,959,0,131.0,1192.0,0
AA,2018-12-31,DFW,SFO,2047,2245,0,194.0,1464.0,0
AS,2018-12-31,SEA,DFW,2315,502,0,210.0,1660.0,3
AS,2018-01-01,SEA,SFO,605,816,0,97.0,679.0,0
B6,2018-12-31,PHX,JFK,2234,509,0,233.0,2153.0,0
B6,2018-01-01,JFK,BOS,550,657,0,39.0,187.0,0

### Exercise 2

<span style="color:green; font-size:16px">For every origin and destination combination, select the 5000th flight.</span>

Only the combinations that have at least 500 flights will have a returned value.

In [103]:
flights.groupby(['origin', 'dest']).nth(499)

                  date airline  dep_time  arr_time  cancelled  air_time  \
origin dest
JFK    LAX  2018-11-27      DL      1925      2300          0     325.0
LAS    LAX  2018-12-21      WN       545       655          0      48.0
LAX    JFK  2018-11-29      DL      1145      2007          0     269.0
       LAS  2018-12-25      AA      1955      2107          0      54.0
       SFO  2018-10-15      WN       955      1115          0      56.0
LGA    ORD  2018-10-17      UA      1700      1836          0     129.0
ORD    LGA  2018-10-14      UA      1300      1615          0      95.0
SFO    LAX  2018-10-19      UA      1300      1435          0      58.0

             distance  carrier_delay
origin dest
JFK    LAX     2475.0              0
LAS    LAX      236.0              0
LAX    JFK     2475.0              0
       LAS      236.0              0
       SFO      337.0              0
LGA    ORD      733.0              0
ORD    LGA      733.0              0
SFO    LAX      337.0              0

### Exercise 3

<span style="color:green; font-size:16px">Find the date of the 10th cancelled flight for each airline.</span>

In [104]:
flights['cancelled_running_total'] = flights.groupby('airline')['cancelled'].cumsum()
flights.head(3)

,date,airline,origin,dest,dep_time,arr_time,cancelled,air_time,distance,carrier_delay,cancelled_running_total
0,2018-01-01,UA,LAS,IAH,100,547,0,134.0,1222.0,0,0
1,2018-01-01,WN,DEN,PHX,515,720,0,91.0,602.0,0,0
2,2018-01-01,B6,JFK,BOS,550,657,0,39.0,187.0,0,0

In [105]:
flights.query("cancelled == 1 and cancelled_running_total == 10")

,date,airline,origin,dest,dep_time,arr_time,cancelled,air_time,distance,carrier_delay,cancelled_running_total
535,2018-01-04,UA,BOS,EWR,800,924,1,NaN,200.0,0,10
627,2018-01-04,AA,EWR,PHX,1620,2009,1,NaN,2133.0,0,10
641,2018-01-04,DL,DTW,PHL,1745,1941,1,NaN,453.0,0,10
702,2018-01-05,B6,BOS,DFW,731,1105,1,NaN,1562.0,0,10
794,2018-01-05,YX,JFK,BOS,1700,1822,1,NaN,187.0,0,10
6988,2018-02-12,NK,IAH,EWR,630,1042,1,NaN,1400.0,0,10
9812,2018-02-27,WN,PHX,LAS,2115,2120,1,NaN,255.0,0,10
10128,2018-03-01,OO,SFO,LAX,1650,1825,1,NaN,337.0,0,10
12161,2018-03-13,9E,JFK,BOS,905,1030,1,NaN,187.0,0,10
13472,2018-03-20,VX,SFO,LAX,2140,2323,1,NaN,337.0,0,10
18329,2018-04-16,MQ,LGA,PHL,1815,1937,1,NaN,96.0,0,10
30049,2018-06-17,AS,EWR,SFO,1725,2054,1,NaN,2565.0,0,10
43852,2018-08-29,YV,ATL,IAH,940,1047,1,NaN,689.0,0,10
46921,2018-09-15,F9,MSP,DEN,840,951,1,NaN,680.0,0,10
46964,2018-09-15,OH,DCA,CLT,1355,1534,1,NaN,331.0,0,10
54726,2018-10-28,EV,DCA,EWR,600,715,1,NaN,199.0,0,10

### Exercise 4

<span style="color:green; font-size:16px">Find the average carrier delay for each origin and destination combination with more than 300 flights.</span>

In [106]:
delay = flights.groupby(['origin', 'dest'])['carrier_delay'].agg(['size', 'mean']).round(1)
delay.head()

             size  mean
origin dest
ATL    BOS    304   2.5
       CLT    262   5.0
       DCA    287   2.2
       DEN    215   3.0
       DFW    289   2.3

In [107]:
delay.query('size > 300').head(10)

             size  mean
origin dest
ATL    BOS    304   2.5
       LGA    411   1.5
       MCO    373   4.6
       ORD    319   2.5
BOS    DCA    383   3.4
       LGA    416   3.3
       ORD    314   1.8
DCA    BOS    348   1.7
       ORD    339   1.2
DEN    LAX    345   6.7